Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ПроведениеПреподавателемОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПреподавателемОбученияСУО</name>
  <registerRecords>InformationRegister.ПроведениеПреподавателямиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПреподавателейСУО</registerRecords>
  <registerRecords>InformationRegister.ПреподавателиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/АвтоРазделыФорумаСУО/АвтоРазделыФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоРазделыФорумаСУО</name>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПП/ДанныеВебКабинетаСУО_ПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроцессаПреподаванияСУО/СтатусыПроцессаПреподаванияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаПреподаванияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Провожу</name>
  </enumValues>
  <enumValues>
    <name>Провел</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыУчебныхАктивностейСУО/ТипыУчебныхАктивностейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчебныхАктивностейСУО</name>
  <enumValues>
    <name>Обучение</name>
  </enumValues>
  <enumValues>
    <name>Преподавание</name>
  </enumValues>
  <enumValues>
    <name>Контроль</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ОБЩЕЕ
	
Функция Отменено(ПроведениеПреподавателемОбучения) Экспорт
	Возврат УправлениеОбучениемСУОПовтИсп.ПроведениеПреподавателемОбученияОтменено(ПроведениеПреподавателемОбучения);
КонецФункции

Функция Актуально(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	СтатусПроцессаПреподавания  = СтатусПроцессаПреподавания(ПроведениеПреподавателемОбучения);

	Возврат ?(СтатусПроцессаПреподавания = Перечисления.СтатусыПроцессаПреподаванияСУО.Провожу, Истина, Ложь);
		
КонецФункции

Функция СтатусПроцессаПреподавания(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПреподавателемОбучения) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		ДанныеПроведенияПреподавателемОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПроведениеПреподавателемОбучения, "Проведено, ПроведениеОбучения, Ссылка");
	Иначе
		ДанныеПроведенияПреподавателемОбучения = ПроведениеПреподавателемОбучения;
	КонецЕсли;	
	
	Если Отменено(ДанныеПроведенияПреподавателемОбучения.Ссылка) Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.ПустаяСсылка();
	КонецЕсли;
	
	ПроведениеОбученияСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПроведенияПреподавателемОбучения.ПроведениеОбучения, "Статус");
	
	Если ПроведениеОбученияСтатус = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Запланировано;
	КонецЕсли;	
	
	Если ПроведениеОбученияСтатус = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
		Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Завершено;		
	КонецЕсли;
	
	Если ПроведениеОбученияСтатус = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
		Если ДанныеПроведенияПреподавателемОбучения.Проведено Тогда
			Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Провел;
		Иначе
			Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.Провожу;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Перечисления.СтатусыПроцессаПреподаванияСУО.ПустаяСсылка();

КонецФункции

Функция Представление(ПроведениеПреподавателемОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПроведениеПреподавателемОбучения) Тогда
		Возврат "<>";
	КонецЕсли;
	
	ТребуемыеСвойства = Новый Структура("
	|НаименованиеСценария,
	|Роль,
	|НаименованиеПользователя,
	|Дата",		
	"Сценарий.Наименование",
	"Роль.Наименование",
	"Пользователь.Наименование",
	"Дата"
	);
	
	ДанныеПроведениеПреподавателемОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, ТребуемыеСвойства);
	
	Если ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО") Тогда
		Возврат Строка(ДанныеПроведениеПреподавателемОбучения.НаименованиеСценария) + " / Преподаватель " + Строка(ДанныеПроведениеПреподавателемОбучения.НаименованиеПользователя) + ", " + Строка(Формат(ДанныеПроведениеПреподавателемОбучения.Дата, "ДЛФ=D")) + " /";
	Иначе
		Возврат Строка(ДанныеПроведениеПреподавателемОбучения.НаименованиеСценария) + " / " + Строка(ДанныеПроведениеПреподавателемОбучения.Роль) + " " + Строка(ДанныеПроведениеПреподавателемОбучения.НаименованиеПользователя) + ", " + Строка(Формат(ДанныеПроведениеПреподавателемОбучения.Дата, "ДЛФ=D")) + " /";
	КонецЕсли;
	
КонецФункции

Функция ТипАктивности() Экспорт
	Возврат Перечисления.ТипыУчебныхАктивностейСУО.Преподавание;
КонецФункции

Функция ПреподавательСкрытОтУченика(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	ДанныеПроведенияПреподавателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, "Проведен, Роль, Сценарий, СкрыватьОтУченика");
	
	Если НЕ ДанныеПроведенияПреподавателя.Проведен Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПроведенияПреподавателя.Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(ДанныеПроведенияПреподавателя.Сценарий) Тогда
		
		Возврат Справочники.КаталогМероприятийСУО.ПреподавательСкрытОтУченика(ДанныеПроведенияПреподавателя.Сценарий, ДанныеПроведенияПреподавателя.Роль);
		
	Иначе
		
		Возврат ДанныеПроведенияПреподавателя.СкрыватьОтУченика;
		
	КонецЕсли;
	
КонецФункции

Функция ДоступноОбщение(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПреподавателемОбучения) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, "Проведено, ПроведениеОбучения");
	Иначе
		Данные = ПроведениеПреподавателемОбучения; 
	КонецЕсли;
	
	
	Если Данные.Проведено Тогда
		Возврат Ложь;
	Иначе
		Возврат Документы.ПроведениеОбученияСУО.ДоступноОбщение(Данные.ПроведениеОбучения);
	КонецЕсли;	
		
КонецФункции

Функция ЕстьАвтоРазделыФорума(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПреподавателемОбучения) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		ПроведениеПреподавателемОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, "Пользователь, ПроведениеОбучения");
	Иначе
		ПроведениеПреподавателемОбученияСвойства = ПроведениеПреподавателемОбучения;
	КонецЕсли;
	
	Возврат РегистрыСведений.АвтоРазделыФорумаСУО.РазделыПользователя(ПроведениеПреподавателемОбученияСвойства.Пользователь, ПроведениеПреподавателемОбученияСвойства.ПроведениеОбучения, Истина); 
	
КонецФункции

Функция СценарийОбучения(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПреподавателемОбучения) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		ПроведениеПреподавателемОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, "Сценарий, ПроведениеОбучения");
	Иначе
		ПроведениеПреподавателемОбученияСвойства = ПроведениеПреподавателемОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПреподавателемОбученияСвойства.Сценарий) Тогда
		Возврат ПроведениеПреподавателемОбученияСвойства.Сценарий;
	Иначе
		Возврат Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеПреподавателемОбученияСвойства.ПроведениеОбучения);
	КонецЕсли;	
	
КонецФункции

Функция ПроведениеОбучения(Знач ПроведениеПреподавателемОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПреподавателемОбучения) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		ПроведениеПреподавателемОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, "ПроведениеОбучения");
	Иначе
		ПроведениеПреподавателемОбученияСвойства = ПроведениеПреподавателемОбучения;
	КонецЕсли;
	
	Возврат ПроведениеПреподавателемОбученияСвойства.ПроведениеОбучения;
	
КонецФункции

Функция РодительскоеОбучение(Знач ПроведениеПреподавателемОбучения) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПреподавателемОбучения, "РодительскоеПроведение");
КонецФункции

Функция УстановитьОтметкуПроведено(Знач ПроведениеПреподавателемОбучения, Знач ЗначениеОтметки) Экспорт
	
	Результат = Новый Структура("Успех", Ложь);	
	
	// Записываем данные
	
	НачатьТранзакцию();
	
	Попытка
		
		// Устанавливаем отметку
		
		ПроведениеПреподавателемОбученияОбъект = ПроведениеПреподавателемОбучения.ПолучитьОбъект();		
		
		// Делаем проверки
		
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(
			ПроведениеПреподавателемОбученияОбъект.ПроведениеОбучения, ПроведениеПреподавателемОбученияОбъект.Сценарий);
		ЭтоЭлектронноеОбучение = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(
			ПроведениеПреподавателемОбученияОбъект.ПроведениеОбучения, ВидОбучения, ПроведениеПреподавателемОбученияОбъект.Сценарий);
		СтатусПроведенияОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПреподавателемОбученияОбъект.ПроведениеОбучения, "Статус");
		
		Если НЕ ЭтоЭлектронноеОбучение
			И СтатусПроведенияОбучения <> Перечисления.СтатусыПроведенияОбъектовСУО.Отменено
			И Документы.ПрохождениеОбученияСУО.ЕстьАктуальныеУчастники(ПроведениеПреподавателемОбученияОбъект.ПроведениеОбучения) Тогда
			
			ОтменитьТранзакцию();	 
			Результат.Вставить("Сообщение",
				Новый Структура("Код, Текст", "needFillTeacherCheckList", НСтр("ru = 'Заполните ведомость полностью. Потом завершите проведение обучения'")));
				
			Возврат Результат;	
			
		КонецЕсли;
		
		ПроведениеПреподавателемОбученияОбъект.Проведено = ЗначениеОтметки;		
		ПроведениеПреподавателемОбученияОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", Истина);		
		ПроведениеПреподавателемОбученияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		// Обновлем веб-кабинет
		
		Если ВебКабинетСУ.Используется() Тогда
			
			ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПроведениеПреподавателемОбученияСУО, ПроведениеПреподавателемОбучения);
			
			// Обновляем данные ВК всех прохождений обучения, так как
			// необходимо обновить видимость помещенных на проверку заданий в списке "Проверить"
		
			ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПреподавателемОбучения, "ПроведениеОбучения");
		
			ТаблицаПрохождений = Документы.ПроведениеОбученияСУО.ПрохожденияОбучения(ПроведениеОбучения, Истина, Ложь);
			
			Для каждого СтрокаТП Из ТаблицаПрохождений Цикл
				
				ПараметрыФЗ = Новый Массив;
				ПараметрыФЗ.Добавить(СтрокаТП.Прохождение);
				ПараметрыФЗ.Добавить(Неопределено);

				ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(СтрокаТП.Прохождение), "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(СтрокаТП.Прохождение.УникальныйИдентификатор()), 1);
			
			КонецЦикла;
			
		КонецЕсли;		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Возвращаем
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(ПроведениеПреподавателемОбучения, ДополнительныеДанные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, "Проведен, Пользователь, ПроведениеОбучения, Сценарий, Проведено");
	
	// Библиотека пользователя
	
	Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПреподавателемОбучения, "Пользователь");
	РегистрыСведений.БиблиотекаПользователейСУО.ОбновитьДанныеВебКабинета(Пользователь);
	
	// Удаляем старые данные
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ПроведениеПреподавателемОбучения);
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(ПроведениеПреподавателемОбучения);
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(ПроведениеПреподавателемОбучения, Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательОбучения);
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(ПроведениеПреподавателемОбучения);
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(ПроведениеПреподавателемОбучения, "Документ.ПроведениеПреподавателемОбученияСУО");
	
	// Добавляем новые данные
	
	Если ДанныеДокумента.Проведен И НЕ Отменено(ПроведениеПреподавателемОбучения) Тогда		
		
		// Активность преподавателя
		
		ДанныеАктивности = ПреподавательскаяАктивностьJSON(ПроведениеПреподавателемОбучения);
		
		ДатаНачалаПроведенияОбучения = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ДанныеДокумента.ПроведениеОбучения, ДанныеДокумента.Сценарий);
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаПроведенияОбучения) Тогда
			РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеДокумента.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательскаяАктивность, ПроведениеПреподавателемОбучения, ДанныеАктивности, Перечисления.ФорматыВебДанныхСУ.json); 
		Иначе
			РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ДатаНачалаПроведенияОбучения, ДанныеДокумента.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательскаяАктивность, ПроведениеПреподавателемОбучения, ДанныеАктивности, Перечисления.ФорматыВебДанныхСУ.json);
		КонецЕсли;
		
		// Описание активности преподавателя
		
		ОписаниеАктивностиПреподавателя = ПреподавательскаяАктивностьОписаниеXML(ПроведениеПреподавателемОбучения);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеДокумента.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательскаяАктивностьОписание, ПроведениеПреподавателемОбучения, ОписаниеАктивностиПреподавателя, Перечисления.ФорматыВебДанныхСУ.xml);
		
		// Преподаватель обучения
		
		ПреподавательОбученияJSON = ПреподавательОбученияJSON(ПроведениеПреподавателемОбучения);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ПреподавательОбучения, ПроведениеПреподавателемОбучения, ПреподавательОбученияJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Отборы объекта
		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПроведениеПреподавателемОбучения, ДанныеДокумента.ПроведениеОбучения);		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПроведениеПреподавателемОбучения, ДанныеДокумента.Сценарий);
		
		Если НЕ ПреподавательСкрытОтУченика(ПроведениеПреподавателемОбучения) Тогда
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПроведениеПреподавателемОбучения, Перечисления.ОтборыДанныхВебКабинетаСУО.Видимые);
		КонецЕсли;
		
		Если ДанныеДокумента.Проведено Тогда
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПроведениеПреподавателемОбучения, Перечисления.ОтборыДанныхВебКабинетаСУО.Завершенные);
		Иначе
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(ПроведениеПреподавателемОбучения, Перечисления.ОтборыДанныхВебКабинетаСУО.Активные);
		КонецЕсли;		
		
		// Зависимости
		
		Зависимости = Новый Массив;
		Зависимости.Добавить(ДанныеДокумента.Пользователь);
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(ПроведениеПреподавателемОбучения, "Документ.ПроведениеПреподавателемОбученияСУО", Зависимости);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПреподавательОбученияJSON(ПроведениеПреподавателемОбучения) Экспорт
	
	ТребуемыеДанные = Новый Структура("
	|Пользователь,
	|НаименованиеПользователя,
	|НаименованиеРоли",
	"Пользователь",
	"Пользователь.Наименование",
	"Роль.Наименование");
	
	ДанныеПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, ТребуемыеДанные);
	
	СвойстваПреподавателя = ВебКабинетСУО.ПользовательСтруктура(ДанныеПрохождения.Пользователь, ДанныеПрохождения.НаименованиеПользователя); 
	
	СвойстваПреподавателя.Вставить("НаименованиеРоли", ДанныеПрохождения.НаименованиеРоли);
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(СвойстваПреподавателя);
	
КонецФункции

Функция ПреподавательскаяАктивностьСтруктура(ПроведениеПреподавателемОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТребуемыеДанные = Новый Структура("
		|Ссылка,
		|Сценарий,
		|Проведено,
		|ПроведениеОбучения,
		|СтатусПроведенияОбучения,
		|ДатаКонтроля,
		|КомментарийДляПреподавателя,
		|ДатаНачалаПроведения,
		|ДатаОкончанияПроведения,  
		|НаОсновеЭлектронногоРесурса,
		|НаОсновеМероприятия,
		|БезСценария,
		|НаименованиеСценария,
		|ЦветАктивногоМероприятияНаКалендареПреподавателя,
		|ЦветЗапланированногоМероприятияНаКалендареПреподавателя,
		|ЦветЗавершенногоМероприятияНаКалендареПреподавателя,
		|ЦветОтмененногоМероприятияНаКалендареПреподавателя,
		|СкрытьВремяПроведения,
		|РодительскоеПроведение,
		|НаименованиеПроведенияОбучения,
		|ФайлКартинки,
		|РасширениеКартинки",
		"Ссылка",
		"Сценарий",
		"Проведено",
		"ПроведениеОбучения",
		"ПроведениеОбучения.Статус",
		"ПроведениеОбучения.ДатаКонтроля",
		"ПроведениеОбучения.КомментарийДляПреподавателя",
		"ДатаНачалаПроведения",
		"ДатаОкончанияПроведения",
		"ПроведениеОбучения.НаОсновеЭлектронногоРесурса",
		"ПроведениеОбучения.НаОсновеМероприятия",
		"ПроведениеОбучения.БезСценария",
		"Сценарий.Наименование",
		"ПроведениеОбучения.ЦветАктивногоМероприятияНаКалендареПреподавателя",
		"ПроведениеОбучения.ЦветЗапланированногоМероприятияНаКалендареПреподавателя",
		"ПроведениеОбучения.ЦветЗавершенногоМероприятияНаКалендареПреподавателя",
		"ПроведениеОбучения.ЦветОтмененногоМероприятияНаКалендареПреподавателя",
		"ПроведениеОбучения.СкрытьВремяПроведения",
		"РодительскоеПроведение",
		"ПроведениеОбучения.Наименование",
		"ПроведениеОбучения.ФайлКартинки",
		"ПроведениеОбучения.ФайлКартинки.Расширение"
		);
		
	СвойстваПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, ТребуемыеДанные);			
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(СвойстваПроведения.ПроведениеОбучения, СвойстваПроведения.Сценарий);
	СтатусПреподавания = СтатусПроцессаПреподавания(СвойстваПроведения);
	
	СтруктураДанных = Новый Структура("
	|Тип,
	|Идентификатор,
	|Наименование,
	|ДатаНачала,
	|ДатаОкончания,
	|Проведено,
	|КомментарийДляПреподавателя,
	|Цвет,
	|СкрытьВремяПроведения,
	|РодительскаяАктивность,
	|СтатусПреподавания,
	|Картинка");	
	
	СтруктураДанных.Идентификатор = Строка(ПроведениеПреподавателемОбучения.УникальныйИдентификатор());
	СтруктураДанных.Тип = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипАктивности());
	СтруктураДанных.Наименование = Документы.ПрохождениеОбученияСУО.НаименованиеОбучения(СвойстваПроведения); 
	СтруктураДанных.Проведено = СвойстваПроведения.Проведено;
	СтруктураДанных.КомментарийДляПреподавателя = СвойстваПроведения.КомментарийДляПреподавателя;
	СтруктураДанных.СкрытьВремяПроведения = СвойстваПроведения.СкрытьВремяПроведения;
	СтруктураДанных.РодительскаяАктивность = СвойстваПроведения.РодительскоеПроведение;
	СтруктураДанных.СтатусПреподавания = Перечисления.СтатусыПроцессаПреподаванияСУО.ЗначениеВЧисло(СтатусПреподавания);
	
	// Цвет
	
	СтруктураДанных.Цвет = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(СвойстваПроведения.ПроведениеОбучения, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Преподавание);
	
	// Картинка обучения
	
	СтруктураДанных.Картинка = "";
	Если ЗначениеЗаполнено(СвойстваПроведения.ФайлКартинки) Тогда
		СтруктураДанных.Картинка = Документы.ПроведениеОбученияСУО.АдресФайлаКартинки(
			СвойстваПроведения.ПроведениеОбучения, СвойстваПроведения.РасширениеКартинки); 
	КонецЕсли;	
	
	// Даты
	
	СтруктураДанных.ДатаНачала = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(СвойстваПроведения.ПроведениеОбучения, СвойстваПроведения.Сценарий));
	СтруктураДанных.ДатаОкончания = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(СвойстваПроведения.ПроведениеОбучения, СвойстваПроведения.Сценарий));
		
	// Завершаем
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПреподавательскаяАктивностьJSON(ПроведениеПреподавателемОбучения) Экспорт
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ПреподавательскаяАктивностьСтруктура(ПроведениеПреподавателемОбучения));
КонецФункции

Функция ПреподавательскаяАктивностьОписаниеXML(ПроведениеПреподавателемОбучения, ИдентификаторФормы = Неопределено, Данные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	//
	
	Если Данные = Неопределено Тогда
		
		ТребуемыеДанные = Новый Структура("
		|Ссылка,		
		|Дата,		
		|НаименованиеПользователя,
		|НаОсновеЭлектронногоРесурса,
		|НаОсновеМероприятия,
		|БезСценария,
		|Сценарий,
		|НаименованиеСценария,
		|ПроведениеОбучения,
		|КомментарийЗапланированногоМероприятияДляПреподавателя,
		|КомментарийАктивногоМероприятияДляПреподавателя,
		|КомментарийЗавершенногоМероприятияДляПреподавателя,
		|КомментарийОтмененногоМероприятияДляПреподавателя,
		|Аудитория,
		|НаименованиеАудитории,
		|НаименованиеТерритории,
		|СтатусПроведенияОбучения,
		|ДатаКонтроля,
		|КомментарийСценарияДляПреподавателя,
		|КомментарийДляПреподавателя,
		|Пользователь,
		|РодительскоеПроведение,
		|ДатаНачалаПроведения,
		|ДатаОкончанияПроведения,
		|Проведено,
		|АдресВИнтернете,
		|Роль,
		|ТолькоПросмотрВедомости,
		|СкрытьВремяПроведения,
		|НаименованиеПроведенияОбучения,
		|ФайлКартинки,
		|РасширениеКартинки",
		"Ссылка",		
		"Дата",		
		"Пользователь.Наименование",
		"ПроведениеОбучения.НаОсновеЭлектронногоРесурса",
		"ПроведениеОбучения.НаОсновеМероприятия",
		"ПроведениеОбучения.БезСценария",
		"Сценарий",
		"Сценарий.Наименование",
		"ПроведениеОбучения",
		"ПроведениеОбучения.КомментарийЗапланированногоМероприятияДляПреподавателя",
		"ПроведениеОбучения.КомментарийАктивногоМероприятияДляПреподавателя",
		"ПроведениеОбучения.КомментарийЗавершенногоМероприятияДляПреподавателя",
		"ПроведениеОбучения.КомментарийОтмененногоМероприятияДляПреподавателя",
		"ПроведениеОбучения.Аудитория",
		"ПроведениеОбучения.Аудитория.Наименование",
		"ПроведениеОбучения.Аудитория.Владелец.Наименование",
		"ПроведениеОбучения.Статус",
		"ПроведениеОбучения.ДатаКонтроля",
		"Сценарий.КомментарийДляПреподавателя",
		"ПроведениеОбучения.КомментарийДляПреподавателя",
		"Пользователь",
		"РодительскоеПроведение",
		"ДатаНачалаПроведения",
		"ДатаОкончанияПроведения",
		"Проведено",
		"ПроведениеОбучения.АдресВИнтернете",
		"Роль",
		"ТолькоПросмотрВедомости",
		"ПроведениеОбучения.СкрытьВремяПроведения",
		"ПроведениеОбучения.Наименование",
		"ПроведениеОбучения.ФайлКартинки",
		"ПроведениеОбучения.ФайлКартинки.Расширение");
		
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПреподавателемОбучения, ТребуемыеДанные);
		
	КонецЕсли;
	
	ВидОбучения           = Документы.ПроведениеОбученияСУО.ВидОбучения(Данные.ПроведениеОбучения, Данные.Сценарий);
	ДоступноОбщение       = ДоступноОбщение(ПроведениеПреподавателемОбучения);
	ЕстьАвтоРазделыФорума = ЕстьАвтоРазделыФорума(ПроведениеПреподавателемОбучения);
	ШкалаОценки           = Документы.ПроведениеОбученияСУО.ШкалаОценки(Данные.ПроведениеОбучения);
	СтатусПреподавания    = СтатусПроцессаПреподавания(Данные);
	
	// Формируем пакет XDTO.
	//
	
	ПроведениеXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/lms/1/TeacherActivity", "ПроведениеПреподавателемОбучения");
	ПроведениеXDTO    = ФабрикаXDTO.Создать(ПроведениеXDTOТип);
	
	// Основные свойства
	
	ПроведениеXDTO.Наименование = Документы.ПрохождениеОбученияСУО.НаименованиеОбучения(Данные);
	ПроведениеXDTO.Проведено = Данные.Проведено;
	ПроведениеXDTO.СтатусПреподавания = Перечисления.СтатусыПроцессаПреподаванияСУО.ЗначениеВЧисло(СтатусПреподавания);
	ПроведениеXDTO.СтатусПреподаванияСтрока = Перечисления.СтатусыПроцессаПреподаванияСУО.ПредставлениеЗначения(СтатусПреподавания);
	ПроведениеXDTO.ПроведениеПреподавателемОбучения = ПроведениеПреподавателемОбучения;
	ПроведениеXDTO.ПроведениеОбучения = Данные.ПроведениеОбучения;
	ПроведениеXDTO.АдресВИнтернете = Данные.АдресВИнтернете;
	ПроведениеXDTO.ДоступенРазделФорума = ДоступноОбщение И ЕстьАвтоРазделыФорума;
	ПроведениеXDTO.СкрытьВремяПроведения = Данные.СкрытьВремяПроведения;
	ПроведениеXDTO.ЭлектронноеОбучение = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(Данные.ПроведениеОбучения, ВидОбучения, Данные.Сценарий);
	ПроведениеXDTO.ВыставляетсяОценка = ВидОбучения.ВыставляетсяОценка;
	ПроведениеXDTO.КоличествоЗаданий = Документы.ПроведениеОбученияСУО.ЗаданияОбучения(Данные.ПроведениеОбучения, Данные.Сценарий,,ВидОбучения).Количество();
	ПроведениеXDTO.ШкалаОценок = Справочники.ШкалыОценокСУО.ШкалаОценокXDTO(ШкалаОценки);
	ПроведениеXDTO.Сценарий = УправлениеОбучениемСУО.СценарийОбученияXDTO(Данные.Сценарий, Данные.НаименованиеСценария);
	ПроведениеXDTO.РазрешеноУчащимсяПрикреплятьФайлы = ВидОбучения.РазрешитьУчащимсяПрикреплятьФайлы;
	ПроведениеXDTO.ЗавершаетсяАвтоматически = ВидОбучения.ЗавершатьАвтоматически;
	
	// Картинка обучения
	
	Если ЗначениеЗаполнено(Данные.ФайлКартинки) Тогда
		ПроведениеXDTO.Картинка = Документы.ПроведениеОбученияСУО.ПутьККаталогуФайловПроведенияОбучения("", Данные.ПроведениеОбучения)
			+ Документы.ПроведениеОбученияСУО.ИмяФайлаКартинки(Данные.РасширениеКартинки);
	КонецЕсли;		
	
	// Даты
	
	ДатаНачалаПроведения = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(Данные.ПроведениеОбучения, Данные.Сценарий);
	ДатаОкончанияПроведения	= Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(Данные.ПроведениеОбучения, Данные.Сценарий);
	
	ПроведениеXDTO.ДатаНачалаПроведенияЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДатаНачалаПроведения);
	ПроведениеXDTO.ДатаОкончанияПроведенияЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДатаОкончанияПроведения);
	ПроведениеXDTO.ДатаКонтроляЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(Данные.ДатаКонтроля);
	ПроведениеXDTO.ДатаКонтроляСтрока = ОбщегоНазначенияСУКлиентСервер.ДатаВСтроку(Данные.ДатаКонтроля, Данные.СкрытьВремяПроведения);
	ПроведениеXDTO.ПериодСтрока = ОбщегоНазначенияСУКлиентСервер.ПериодВСтроку(ДатаНачалаПроведения, ДатаОкончанияПроведения, Данные.СкрытьВремяПроведения);	
	
	// Описание единственного задания

	ЕдинственноеЗадание = Документы.ПроведениеОбученияСУО.ОписаниеЕдинственногоЗаданияОбучения(Данные.ПроведениеОбучения, Данные.Сценарий);
	
	Если ЕдинственноеЗадание <> Неопределено Тогда
		ПроведениеXDTO.ЕдинственноеЗадание = Документы.ПрохождениеОбученияСУО.ОписаниеЗаданияXDTO(ЕдинственноеЗадание);
	КонецЕсли;		
	
	// Комментарии
	
	ПроведениеXDTO.КомментарийПреподавателюОтМенеджера = Данные.КомментарийДляПреподавателя;
	
	Если ЗначениеЗаполнено(Данные.КомментарийСценарияДляПреподавателя) И Данные.КомментарийСценарияДляПреподавателя <> ПроведениеXDTO.КомментарийПреподавателюОтМенеджера Тогда
		
		Если ЗначениеЗаполнено(ПроведениеXDTO.КомментарийПреподавателюОтМенеджера) Тогда
			ПроведениеXDTO.КомментарийПреподавателюОтМенеджера = ПроведениеXDTO.КомментарийПреподавателюОтМенеджера + Символы.ПС;
		КонецЕсли;
		
		ПроведениеXDTO.КомментарийПреподавателюОтМенеджера = ПроведениеXDTO.КомментарийПреподавателюОтМенеджера + Данные.КомментарийСценарияДляПреподавателя;
		
	КонецЕсли;
	
	
	КонтекстныйКомментарийИмяРеквизита = "";
	
	Если Данные.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Запланировано Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийЗапланированногоМероприятияДляПреподавателя";	
	КонецЕсли;
	
	Если Данные.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Активно Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийАктивногоМероприятияДляПреподавателя";	
	КонецЕсли;
	
	Если Данные.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Завершено Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийЗавершенногоМероприятияДляПреподавателя";	
	КонецЕсли;
	
	Если Данные.СтатусПроведенияОбучения = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		КонтекстныйКомментарийИмяРеквизита = "КомментарийОтмененногоМероприятияДляПреподавателя";	
	КонецЕсли;
	
	КонтекстныйКомментарийФорматированныйДокумент = Данные[КонтекстныйКомментарийИмяРеквизита].Получить();
	
	Если ЗначениеЗаполнено(ИдентификаторФормы) Тогда
		
		КонтекстныйКомментарийHTML = СокрЛП(ОбщегоНазначенияСУ.ПредставлениеФорматированныйДокументДляПоляHTML(КонтекстныйКомментарийФорматированныйДокумент, ИдентификаторФормы));
		
	Иначе
		
		КонтекстныйКомментарийСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(КонтекстныйКомментарийФорматированныйДокумент, Строка(Данные.ПроведениеОбучения.УникальныйИдентификатор()), КонтекстныйКомментарийИмяРеквизита, Истина);
		
		КонтекстныйКомментарийHTML = СокрЛП(КонтекстныйКомментарийСтруктура.ПредставлениеHTML);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтекстныйКомментарийHTML) Тогда
		ПроведениеXDTO.КомментарийПреподавателюОтМенеджераКонтекстный = КонтекстныйКомментарийHTML;
	КонецЕсли;		
	
	// Место проведения
	
	Если ЗначениеЗаполнено(Данные.Аудитория) Тогда
		ПроведениеXDTO.Аудитория  = Данные.НаименованиеАудитории;
		ПроведениеXDTO.Территория = Данные.НаименованиеТерритории;
	КонецЕсли;
	
	// Ресурсы
	
	ПроведениеXDTO.Ресурсы = Документы.ПрохождениеОбученияСУО.РесурсыОбученияXDTO(Данные, Ложь);
	
	// Получаем XML.
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПроведениеXDTO);
	
	Возврат ЗаписьXML.Закрыть();
	
	
КонецФункции

// 1С-КАБИНЕТ

Функция УчебнаяАктивностьОписаниеHTML(ПроведениеПреподавателемОбучения, ИдентификаторФормы=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПроведенияПреподавателемОбучения = Неопределено;
	
	XMLДанные = ПреподавательскаяАктивностьОписаниеXML(ПроведениеПреподавателемОбучения, ИдентификаторФормы, ДанныеПроведенияПреподавателемОбучения);
	
	// Получаем представление HTML.
	
	Преобразование = Новый ПреобразованиеXSL;
	ШаблонXSL = ПолучитьОбщийМакет("ШаблонОписанияУчебнойАктивностиСУО").ПолучитьТекст();	
	
	Преобразование.ЗагрузитьИзСтроки(ШаблонXSL);
	Преобразование.ДобавитьПараметр("ПросматриваетВладелец", ОбщегоНазначенияСУКлиентСервер.БулевоВЧисло(Пользователи.ТекущийПользователь() = ДанныеПроведенияПреподавателемОбучения.Пользователь));
	
	ИтоговыйHTML = Преобразование.ПреобразоватьИзСтроки(XMLДанные);
	
	Возврат ИтоговыйHTML;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Представление(Данные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
